INSERT INTO `library_in_json`
(
    `lij_id`,
    `lij_book`,
    `lij_author`,
    `lij_genre`
) VALUES
(1, 'Евгений Онегин', '[{"id":7,"name":"А.С. Пушкин"}]', '[{"id":1,"name":"Поэзия"},{"id":5,"name":"Классика"}]'),
(2, 'Искусство программирования', '[{"id":1,"name":"Д. Кнут"}]', '[{"id":2,"name":"Программирование"},{"id":5,"name":"Классика"}]'),
(3, 'Курс теоретической физики', '[{"id":4,"name":"Л.Д. Ландау"},{"id":5,"name":"Е.М. Лифшиц"}]', '[{"id":5,"name":"Классика"}]'),
(4, 'Основание и империя', '[{"id":2,"name":"А. Азимов"}]', '[{"id":6,"name":"Фантастика"}]'),
(5, 'Психология программирования', '[{"id":3,"name":"Д. Карнеги"},{"id":6,"name":"Б. Страуструп"}]', '[{"id":2,"name":"Программирование"},{"id":3,"name":"Психология"}]'),
(6, 'Сказка о рыбаке и рыбке', '[{"id":7,"name":"А.С. Пушкин"}]', '[{"id":1,"name":"Поэзия"},{"id":5,"name":"Классика"}]'),
(7, 'Язык программирования С++', '[{"id":6,"name":"Б. Страуструп"}]', '[{"id":2,"name":"Программирование"}]');