SET IDENTITY_INSERT [library_in_json] ON;
INSERT INTO [library_in_json]
(
    [lij_id],
	[lij_book],
    [lij_author],
    [lij_genre]
) VALUES
(1, N'Евгений Онегин', N'[{"id":7,"name":"А.С. Пушкин"}]', N'[{"id":1,"name":"Поэзия"},{"id":5,"name":"Классика"}]'),
(2, N'Искусство программирования', N'[{"id":1,"name":"Д. Кнут"}]', N'[{"id":2,"name":"Программирование"},{"id":5,"name":"Классика"}]'),
(3, N'Курс теоретической физики', N'[{"id":4,"name":"Л.Д. Ландау"},{"id":5,"name":"Е.М. Лифшиц"}]', N'[{"id":5,"name":"Классика"}]'),
(4, N'Основание и империя', N'[{"id":2,"name":"А. Азимов"}]', N'[{"id":6,"name":"Фантастика"}]'),
(5, N'Психология программирования', N'[{"id":3,"name":"Д. Карнеги"},{"id":6,"name":"Б. Страуструп"}]', N'[{"id":2,"name":"Программирование"},{"id":3,"name":"Психология"}]'),
(6, N'Сказка о рыбаке и рыбке', N'[{"id":7,"name":"А.С. Пушкин"}]', N'[{"id":1,"name":"Поэзия"},{"id":5,"name":"Классика"}]'),
(7, N'Язык программирования С++', N'[{"id":6,"name":"Б. Страуструп"}]', N'[{"id":2,"name":"Программирование"}]');
SET IDENTITY_INSERT [library_in_json] OFF;